kong-performance/src/results/kong.log
Mon Jan 27 00:58:32 UTC 2020
Concurrency Level: 10

Summary:
  Total:	0.6783 secs
  Slowest:	0.0173 secs
  Fastest:	0.0009 secs
  Average:	0.0066 secs
  Requests/sec:	1474.2999
  
  Total data:	11516 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.003 [20]	|■■
  0.004 [92]	|■■■■■■■■■■
  0.006 [293]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [359]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [110]	|■■■■■■■■■■■■
  0.011 [54]	|■■■■■■
  0.012 [29]	|■■■
  0.014 [27]	|■■■
  0.016 [6]	|■
  0.017 [9]	|■


Latency distribution:
  10% in 0.0040 secs
  25% in 0.0051 secs
  50% in 0.0063 secs
  75% in 0.0074 secs
  90% in 0.0096 secs
  95% in 0.0117 secs
  99% in 0.0153 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0009 secs, 0.0173 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0065 secs, 0.0009 secs, 0.0172 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	1000 responses



Concurrency Level: 50

Summary:
  Total:	3.0533 secs
  Slowest:	0.1672 secs
  Fastest:	0.0008 secs
  Average:	0.0290 secs
  Requests/sec:	1637.5866
  
  Total data:	57763 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.017 [706]	|■■■■■■■■■
  0.034 [3238]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.051 [787]	|■■■■■■■■■■
  0.067 [213]	|■■■
  0.084 [36]	|
  0.101 [2]	|
  0.117 [0]	|
  0.134 [0]	|
  0.151 [11]	|
  0.167 [6]	|


Latency distribution:
  10% in 0.0155 secs
  25% in 0.0216 secs
  50% in 0.0290 secs
  75% in 0.0335 secs
  90% in 0.0395 secs
  95% in 0.0515 secs
  99% in 0.0688 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1672 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0080 secs
  resp wait:	0.0287 secs, 0.0008 secs, 0.1191 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0097 secs

Status code distribution:
  [200]	5000 responses



Concurrency Level: 100

Summary:
  Total:	5.5709 secs
  Slowest:	0.1804 secs
  Fastest:	0.0010 secs
  Average:	0.0547 secs
  Requests/sec:	1795.0342
  
  Total data:	115053 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.019 [177]	|■■
  0.037 [1103]	|■■■■■■■■■■
  0.055 [4208]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.073 [3287]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.091 [748]	|■■■■■■■
  0.109 [264]	|■■■
  0.127 [145]	|■
  0.145 [57]	|■
  0.162 [5]	|
  0.180 [5]	|


Latency distribution:
  10% in 0.0346 secs
  25% in 0.0441 secs
  50% in 0.0529 secs
  75% in 0.0625 secs
  90% in 0.0752 secs
  95% in 0.0892 secs
  99% in 0.1189 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0010 secs, 0.1804 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0108 secs
  resp wait:	0.0545 secs, 0.0009 secs, 0.1804 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0042 secs

Status code distribution:
  [200]	10000 responses



Concurrency Level: 200

Summary:
  Total:	10.4406 secs
  Slowest:	0.4796 secs
  Fastest:	0.0007 secs
  Average:	0.0971 secs
  Requests/sec:	1915.5951
  
  Total data:	230612 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.049 [1406]	|■■■■■
  0.096 [10938]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.144 [4703]	|■■■■■■■■■■■■■■■■■
  0.192 [2489]	|■■■■■■■■■
  0.240 [323]	|■
  0.288 [79]	|
  0.336 [27]	|
  0.384 [23]	|
  0.432 [8]	|
  0.480 [3]	|


Latency distribution:
  10% in 0.0570 secs
  25% in 0.0736 secs
  50% in 0.0878 secs
  75% in 0.1091 secs
  90% in 0.1588 secs
  95% in 0.1727 secs
  99% in 0.2132 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0007 secs, 0.4796 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0125 secs
  resp wait:	0.0963 secs, 0.0006 secs, 0.2967 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0375 secs

Status code distribution:
  [200]	20000 responses



Concurrency Level: 300

Summary:
  Total:	14.5345 secs
  Slowest:	1.5227 secs
  Fastest:	0.0008 secs
  Average:	0.1340 secs
  Requests/sec:	2064.0492
  
  Total data:	345542 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.153 [21461]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.305 [8197]	|■■■■■■■■■■■■■■■
  0.457 [276]	|■
  0.610 [43]	|
  0.762 [20]	|
  0.914 [0]	|
  1.066 [0]	|
  1.218 [0]	|
  1.370 [0]	|
  1.523 [2]	|


Latency distribution:
  10% in 0.0700 secs
  25% in 0.0982 secs
  50% in 0.1261 secs
  75% in 0.1600 secs
  90% in 0.2083 secs
  95% in 0.2429 secs
  99% in 0.3163 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0008 secs, 1.5227 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0345 secs
  resp wait:	0.1324 secs, 0.0007 secs, 1.5137 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0655 secs

Status code distribution:
  [200]	30000 responses



Concurrency Level: 400

Summary:
  Total:	20.8029 secs
  Slowest:	1.7573 secs
  Fastest:	0.0009 secs
  Average:	0.1934 secs
  Requests/sec:	1922.8110
  
  Total data:	460994 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.177 [18182]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.352 [20023]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.528 [1436]	|■■■
  0.703 [122]	|
  0.879 [1]	|
  1.055 [0]	|
  1.230 [48]	|
  1.406 [65]	|
  1.582 [60]	|
  1.757 [26]	|


Latency distribution:
  10% in 0.0900 secs
  25% in 0.1251 secs
  50% in 0.1863 secs
  75% in 0.2371 secs
  90% in 0.2829 secs
  95% in 0.3362 secs
  99% in 0.4936 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0004 secs, 0.0009 secs, 1.7573 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0373 secs
  resp wait:	0.1899 secs, 0.0007 secs, 1.4838 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0490 secs

Status code distribution:
  [200]	39964 responses

Error distribution:
  [36]	Get http://127.0.0.1:8000/test/: EOF

Concurrency Level: 500

Summary:
  Total:	25.9549 secs
  Slowest:	2.3277 secs
  Fastest:	0.0007 secs
  Average:	0.2430 secs
  Requests/sec:	1926.4162
  
  Total data:	576348 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.233 [27900]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.466 [20012]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.699 [1522]	|■■
  0.932 [165]	|
  1.164 [24]	|
  1.397 [170]	|
  1.630 [99]	|
  1.862 [62]	|
  2.095 [2]	|
  2.328 [43]	|


Latency distribution:
  10% in 0.1174 secs
  25% in 0.1616 secs
  50% in 0.2232 secs
  75% in 0.2788 secs
  90% in 0.3768 secs
  95% in 0.4417 secs
  99% in 0.7291 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0007 secs, 2.3277 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0546 secs
  resp wait:	0.2356 secs, 0.0006 secs, 2.3252 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0552 secs

Status code distribution:
  [200]	50000 responses