kong-performance/src/results/nginx.log
Mon Jan 27 00:55:48 UTC 2020
Concurrency Level: 10

Summary:
  Total:	0.6704 secs
  Slowest:	0.0109 secs
  Fastest:	0.0006 secs
  Average:	0.0066 secs
  Requests/sec:	1491.5676
  
  Total data:	11497 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.002 [4]	|
  0.003 [6]	|
  0.004 [18]	|■
  0.005 [12]	|■
  0.006 [28]	|■■
  0.007 [533]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [293]	|■■■■■■■■■■■■■■■■■■■■■■
  0.009 [58]	|■■■■
  0.010 [40]	|■■■
  0.011 [7]	|■


Latency distribution:
  10% in 0.0059 secs
  25% in 0.0062 secs
  50% in 0.0066 secs
  75% in 0.0070 secs
  90% in 0.0080 secs
  95% in 0.0088 secs
  99% in 0.0097 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0109 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0039 secs
  resp wait:	0.0066 secs, 0.0006 secs, 0.0108 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	1000 responses



Concurrency Level: 50

Summary:
  Total:	3.1610 secs
  Slowest:	0.0748 secs
  Fastest:	0.0011 secs
  Average:	0.0303 secs
  Requests/sec:	1581.7559
  
  Total data:	57727 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.008 [139]	|■■■
  0.016 [49]	|■
  0.023 [229]	|■■■■
  0.031 [1971]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.038 [2146]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.045 [337]	|■■■■■■
  0.053 [69]	|■
  0.060 [37]	|■
  0.067 [10]	|
  0.075 [12]	|


Latency distribution:
  10% in 0.0242 secs
  25% in 0.0275 secs
  50% in 0.0308 secs
  75% in 0.0334 secs
  90% in 0.0377 secs
  95% in 0.0401 secs
  99% in 0.0545 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0011 secs, 0.0748 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0069 secs
  resp wait:	0.0302 secs, 0.0010 secs, 0.0748 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	5000 responses



Concurrency Level: 100

Summary:
  Total:	5.8277 secs
  Slowest:	0.0972 secs
  Fastest:	0.0012 secs
  Average:	0.0549 secs
  Requests/sec:	1715.9457
  
  Total data:	115416 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.011 [53]	|■
  0.020 [56]	|■
  0.030 [295]	|■■■■■
  0.040 [1798]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.049 [1682]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.059 [1370]	|■■■■■■■■■■■■■■■■■■■■■■
  0.068 [2454]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.078 [1705]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.088 [513]	|■■■■■■■■
  0.097 [73]	|■


Latency distribution:
  10% in 0.0339 secs
  25% in 0.0405 secs
  50% in 0.0580 secs
  75% in 0.0676 secs
  90% in 0.0743 secs
  95% in 0.0792 secs
  99% in 0.0863 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0012 secs, 0.0972 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0172 secs
  resp wait:	0.0547 secs, 0.0012 secs, 0.0972 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0137 secs

Status code distribution:
  [200]	10000 responses



Concurrency Level: 200

Summary:
  Total:	26.9191 secs
  Slowest:	1.2191 secs
  Fastest:	0.0012 secs
  Average:	0.2532 secs
  Requests/sec:	742.9671
  
  Total data:	230568 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.123 [2823]	|■■■■■■■■
  0.245 [2676]	|■■■■■■■■
  0.367 [13765]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.488 [641]	|■■
  0.610 [92]	|
  0.732 [0]	|
  0.854 [0]	|
  0.975 [0]	|
  1.097 [0]	|
  1.219 [2]	|


Latency distribution:
  10% in 0.1080 secs
  25% in 0.2323 secs
  50% in 0.2775 secs
  75% in 0.3059 secs
  90% in 0.3311 secs
  95% in 0.3518 secs
  99% in 0.4492 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0012 secs, 1.2191 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0002 secs, 0.0000 secs, 0.0658 secs
  resp wait:	0.2525 secs, 0.0011 secs, 1.2190 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0213 secs

Status code distribution:
  [200]	20000 responses



Concurrency Level: 300

Summary:
  Total:	33.7691 secs
  Slowest:	3.2196 secs
  Fastest:	0.0014 secs
  Average:	0.3135 secs
  Requests/sec:	888.3868
  
  Total data:	345959 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.323 [19469]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.645 [7635]	|■■■■■■■■■■■■■■■■
  0.967 [2584]	|■■■■■
  1.289 [239]	|
  1.611 [47]	|
  1.932 [6]	|
  2.254 [5]	|
  2.576 [4]	|
  2.898 [4]	|
  3.220 [6]	|


Latency distribution:
  10% in 0.0975 secs
  25% in 0.1251 secs
  50% in 0.2641 secs
  75% in 0.4820 secs
  90% in 0.6432 secs
  95% in 0.6908 secs
  99% in 0.9686 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0014 secs, 3.2196 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0193 secs
  resp wait:	0.3131 secs, 0.0014 secs, 3.1762 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0234 secs

Status code distribution:
  [200]	30000 responses



Concurrency Level: 400

Summary:
  Total:	47.5968 secs
  Slowest:	3.2798 secs
  Fastest:	0.0014 secs
  Average:	0.3893 secs
  Requests/sec:	840.3932
  
  Total data:	461520 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.329 [17313]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.657 [18019]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.985 [3864]	|■■■■■■■■■
  1.313 [627]	|■
  1.641 [63]	|
  1.968 [0]	|
  2.296 [0]	|
  2.624 [0]	|
  2.952 [0]	|
  3.280 [113]	|


Latency distribution:
  10% in 0.1003 secs
  25% in 0.1907 secs
  50% in 0.3699 secs
  75% in 0.5181 secs
  90% in 0.6926 secs
  95% in 0.8197 secs
  99% in 1.1164 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0014 secs, 3.2798 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0353 secs
  resp wait:	0.3886 secs, 0.0013 secs, 3.2797 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0340 secs

Status code distribution:
  [200]	40000 responses



Concurrency Level: 500

Summary:
  Total:	40.6292 secs
  Slowest:	9.2933 secs
  Fastest:	0.0013 secs
  Average:	0.3671 secs
  Requests/sec:	1230.6420
  
  Total data:	576762 bytes
  Size/request:	11 bytes

Response time histogram:
  0.001 [1]	|
  0.930 [47498]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.860 [1916]	|■■
  2.789 [26]	|
  3.718 [241]	|
  4.647 [132]	|
  5.576 [30]	|
  6.506 [82]	|
  7.435 [22]	|
  8.364 [20]	|
  9.293 [32]	|


Latency distribution:
  10% in 0.1291 secs
  25% in 0.1670 secs
  50% in 0.2502 secs
  75% in 0.4015 secs
  90% in 0.5751 secs
  95% in 0.9799 secs
  99% in 3.1912 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0013 secs, 9.2933 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0281 secs
  resp wait:	0.3661 secs, 0.0012 secs, 9.2779 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0983 secs

Status code distribution:
  [200]	50000 responses